Repository: mozilla-l10n/mt-training-data
Catalog: zu/zu_pontoon.tmx
Source language: en_us
Languages: zu

source: Thank you once more. We are looking forward to seeing you more often around SUMO! Keep rocking!
zu: Siyabonga futhi. Sizokuthokozela ukukubona njalo ku-SUMO! Hlala uhamba wedwa!

source: Thank you! Your question will appear on the site as soon as you confirm your email address. You should receive an email shortly with a link to confirm.
zu: Siyabonga! Umbuzo wakho uzovela kusayithi uma usuqinisekisile ikheli lakho le-imeyli. Uzothola i-imeyli maduzane nje ehambisana nelinki ukuqinisekisa.

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
zu: Lelo kheli le-imeyli alinamsebenzisi elixhunywe kuye. Unesiqiniseko sokuthi ubhalisile?

source: That tag does not exist.
zu: Ayikho ithegi enje.

source: The basics of using bookmarks
zu: Ulwazi oluyisisekelo sokusebenzisa amabhukumaka

source: The body content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Okuqukethwe emzimbeni kufishane kakhulu (%(show_value)s ezinhlamvu). Kufanele okungenani kube %(limit_value)s wezinhlamvu.

source: The community forum is at %(url)s .
zu: Inkundla yomphakathi iku- %(url)s .

source: The content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Okuqukethwe kufishane kakhulu (%(show_value)s ezinhlamvu). Kufanele kube okungenani %(limit_value)s ezinhlamvu.

source: The dashboard data is being loaded. This may take some time.
zu: Idatha yeshibhodi iyalodwa. Lokhu kungathatha isikhashana.

source: The {default_locale} version has no approved content to show.
zu: Iveshini {default_locale} ayigunyazanga ukuba kuvezwe lokhu.

source: The document %(document_title)s has a new revision that is ready for localization.
zu: Idokhumenti %(document_title)s sesithole isibukezo esisha esesilungele ukumiswa njengesasendaweni.

source: The document has been deleted.
zu: Idokhumenti idilithiwe.

source: The document "%s" does not exist.
zu: Ayikho idokhumenti "%s" enjenga le.

source: The {domain} team
zu: Ithimba le {domain}

source: The email you entered ({new_email}) already exists in the system. The current email for your account is still {old_email}.
zu: I-imeyli oyifakile ({new_email}) isikhon avele kusistimu. I-imeyli yakho ayikashintshi {old_email}.

source: The flag is invalid.
zu: Ifulegi alisebenzi.

source: The flag is valid and I fixed the issue.
zu: Ifulegi liyasebenza futhi sengiyilungisile inkinga.

source: The following articles include this image:
zu: Ama-athikhili alandelayo abandakanya lo mfanekiso:

source: The image "%s" does not exist.
zu: Umfanekiso "%s" awukho.

source: The message was deleted!
zu: Umyalezo udilithiwe!

source: The Mozilla Support team
zu: Ithimba Lokwesekwa kwe-Mozilla

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
zu: Ilinki yokusetha kabusha iphasiwedi ayisebenzi, kungenzeka ukuthi vele isisetshenzisiwe. Uyacelwa ukub aufake isicelo sokusetha kabusha iphasiwedi entsha.

source: The question:
zu: Umbuzo:

source: The questions forum isn't available for {product} in {old_lang}, we have redirected you to the {new_lang} questions forum.
zu: Isithangami semibuzo asitholakali ku{product} nge-{old_lang}, sikuqondise ku-{new_lang} isithangami semibuzo.

source: The questions forum isn't available in {old_lang}, we have redirected you to the {new_lang} questions forum.
zu: Isithangami semibuzo asitholakali nge-{old_lang}, sikuqondise ku-{new_lang} isithangami semibuzo.

source: The question: '{title}' was marked as solved by its asker, {asker}.
zu: Umbuzo: '{title}' besiphawulwe njengesisonjululiwe yilowo osibuzile, {asker}.

source: There are no articles.
zu: Akukho ma-athikhili.

source: There are no messages here.
zu: Akukho miyalezo lapha.

source: There are no threads. Maybe you should create some!
zu: Akukho chungechunge. Mhlawumbe kufanele kube khona olwakhayo!

source: There are several ways in which you can get involved:
zu: Kunezindlela eziningi ongazibandakanya ngazo:

source: There are {total} users with at least one contribution in the last 90 days.
zu: Kunabasebenzisi aba-{total} ababe negalelo okungenani elilodwa ezinsukwini ezingama-90 ezedlule.

source: The refund request must be made within 10 business days of purchase.
zu: Isicelo sokubuyiselwa imali kufanele senziwe ezinsukwini eziyi-10 zokusebenza uthengile.

source: There is no flagged content pending moderation.
zu: Akukho mbhalo ofulegiwe nolindele ukulungiswa.

source: There is no topic data available for the current selections.
zu: Akukho mininingwane yesihloko esikhethwe njengamanje.

source: The requested image could not be found.
zu: Umfanekiso oceliwe awutholakalanga.

source: There was an error.
zu: Kube nephutha.

source: There was an error checking for canned responses.
zu: Kub enephutha ngenkathi kucingwa izimpendulo ezisethiwe.

source: There was an error generating the preview.
zu: Kube nephutha ngenkathi kwakhiwa isibukisi sangaphambilini.

source: There was an error. Please try again in a moment.
zu: Kube nephutha. Uyacelwa uphinde uzame emva kwesikhashana.

source: There was an error submitting the ticket. Please try again later.
zu: Kube nephutha ngenkathi uletha ithikithi. Uyacelwa uphind euzame futhi emva kwesikhashana.

source: There was an error submitting your vote.
zu: Kube nephutha ngenkathi kuhanjiswa ivoti lakho.

source: There was a problem confirming your subscription.
zu: Kube nenkinga ngenkathi kuqinisekiswa ukubhalisa kwakho.

source: There was a problem unsubscribing.
zu: Kube nenkinga ngenkathi usula ukubhalisa ukuthola imibiko.

source: There were errors adding leaders to the group, see below.
zu: Kube namaphutha ngenkathi kufakwa abaholi eqenjini, buka ngezansi.

source: There were errors adding members to the group, see below.
zu: Kube namaphutha lapho kufakwa amalungu eqenjini, buka ngezansi.

source: There were errors adding new contributors, see below.
zu: Kube namaphautha ngenkathi kwengezwa abanegalelo, buka ngezansi.

source: There were errors adding users, see below.
zu: Kube namaphuth alapho kufakwa abasebenzisi, buka ngezansi.

source: These are the top 50 most visited articles in the last 30 days.
zu: Lawa ngama-athikhili angama-50 aphezulu avakashelwe kakhulu ezinsukwini ezingama-30 ezidlule.

source: These fine people helped write this article: %(contributors)s. You can help too - <a href="%(link)s">find out how</a>.
zu: Laba bantu abalungile basizile ukubhala le athikhili: %(contributors)s. Nawe ungasiza - <a href="%(link)s">thola ukuthi kanjani</a>.

source: These minor changes are not important for localizers and they will not be notified.
zu: Lezi zinguquko ezingatheni azialulekanga kubahumushi futhi ngeke baziswe.

source: The {sitename} team
zu: Ithimba le{sitename}

source: The slug is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: I-slug imfishane kakhulu (%(show_value)s ezinhlamvu). Kufanele okungenani kube %(limit_value)s ezinhlamvu.

source: The slug provided is not valid.
zu: I-slug ehlinzekiwe ayisebenzi.

source: The solution was undone successfully.
zu: Isisombululo senziwe ngempumelelo.

source: The subject is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Isihloko sifishane kakhulu (%(show_value)s ezinhlamvu). Kufanele okungenani kube %(limit_value)s wezinhlamvu.

source: The summary is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Isifingqo sifushane kakhulu (%(show_value)s izinhlamvu). Kufanele okungenani kube %(limit_value)s wezinhlamvu.

source: The SUMO Army of Awesome 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2010 badge earners for advancing the Mozilla Mission!
zu: I-SUMO Ithimba Labaphambili 2010 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2010; lapha-ke; ama-tweet angama-50 agunyaziwe. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Ithimba Labaphambili 2010 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO Army of Awesome 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2011 badge earners for advancing the Mozilla Mission!
zu: I-SUMO Ithimba Labaphambili 2011 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2011; lapha-ke; ama-tweet angama-50 agunyaziwe. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Ithimba Labaphambili 2011 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO Army of Awesome 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2012 badge earners for advancing the Mozilla Mission!
zu: I-SUMO Ithimba Labaphambili 2012 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2012; lapha-ke; ama-tweet angama-50 agunyaziwe. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Ithimba Labaphambili 2012 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO Army of Awesome 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2013 badge earners for advancing the Mozilla Mission!
zu: I-SUMO Ithimba Labaphambili 2013 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2013; lapha-ke; ama-tweet angama-50 agunyaziwe. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Ithimba Labaphambili 2013 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO Army of Awesome 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2014 badge earners for advancing the Mozilla Mission!
zu: I-SUMO Ithimba Labaphambili 2014 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2014; lapha-ke; ama-tweet angama-50 agunyaziwe. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Ithimba Labaphambili 2014 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO Forum 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2010 badge earners for advancing the Mozilla Mission!
zu: I-SUMO Ithimba Labaphambili 2010 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2010; lapha-ke; izimpendulo ezingama-30 kusithangami sesiNgisi se-SUMO. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Ithimba Labaphambili 2010 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO Forum 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2011 badge earners for advancing the Mozilla Mission!
zu: I-SUMO FORUM 2011 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2011; lapha-ke; ukuhlelwa okuyi-30 okugunyaziwe kwe-SUMO Knowledge FORUM yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO KB 2011 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO Forum 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2012 badge earners for advancing the Mozilla Mission!
zu: I-SUMO Ithimba Labaphambili 2012 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2012; lapha-ke; izimpendulo ezingama-30 kusithangami sesiNgisi se-SUMO. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Ithimba Labaphambili 2012 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO Forum 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2013 badge earners for advancing the Mozilla Mission
zu: I-SUMO Forum 2013 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2013; lapha-ke; ukuhlelwa okuyi-30 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Forum 2013 ngokuphucula Umsebenzi we-Mozilla

source: The SUMO Forum 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2014 badge earners for advancing the Mozilla Mission!
zu: I-SUMO Forum 2014 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2014; lapha-ke; izimpendulo ezingama-30 Kusithangami se-SUMO sesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO Forum 2014 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO KB 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2010 badge earners for advancing the Mozilla Mission
zu: I-SUMO KB 2010 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2010; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO KB 2010 ngokuphucula Umsebenzi we-Mozilla

source: The SUMO KB 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2011 badge earners for advancing the Mozilla Mission!
zu: I-SUMO KB 2011 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2011; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO KB 2011 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO KB 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2012 badge earners for advancing the Mozilla Mission!
zu: I-SUMO KB 2012 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2012; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO KB 2012 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO KB 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2013 badge earners for advancing the Mozilla Mission!
zu: I-SUMO KB 2013 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2013; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO KB 2013 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO KB 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2014 badge earners for advancing the Mozilla Mission
zu: I-SUMO KB 2014 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2014; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO KB 2014 ngokuphucula Umsebenzi we-Mozilla

source: The SUMO L10n 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2010 badge earners for advancing the Mozilla Mission!
zu: I-SUMO L10n 2010 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2010; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO L10n 2010 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO L10n 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2011 badge earners for advancing the Mozilla Mission!
zu: I-SUMO L10n 2011 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2011; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO L10n 2011 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO L10n 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2012 badge earners for advancing the Mozilla Mission!
zu: I-SUMO L10n 2012 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2012; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO L10n 2012 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO L10n 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2013 badge earners for advancing the Mozilla Mission!
zu: I-SUMO L10n 2013 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2013; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO L10n 2013 ngokuphucula Umsebenzi we-Mozilla!

source: The SUMO L10n 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2014 badge earners for advancing the Mozilla Mission!
zu: I-SUMO L10n 2014 mini-badge yingxenye yochungechunge lwe-SUMO. Imele wonke amagalelo e-SUMO ngowezi-2014; lapha-ke; ukuhlelwa okuyi-10 okugunyaziwe kwe-SUMO Knowledge Base yesiNgisi. Sihalalisela bonke abazihlomulele ngamabheji e-SUMO L10n 2014 ngokuphucula Umsebenzi we-Mozilla!

source: The template "%s" does not exist or has no approved revision.
zu: Ithempulethi "%s" enjengale ayikho noma ayinasibukezo esigunyaziwe.

source: The title is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Isihloko sifishane kakhulu (%(show_value)s amanani ezinhlamvu). Kufanele kube okungenani %(limit_value)s amanani izinhlamvu.

source: The URL has changed!
zu: I-URL isishintshile!

source: The user name you entered is inappropriate. Please pick another and consider that our helpers are other Firefox users just like you.
zu: Igama lomsebenzisi olifakile alilungile. Uyacelwa uthathe elinye ungakhohlwa ukuthi abasizi bethu bangabasebenzisi be-Firefox njengawe.

source: The video "%s" does not exist.
zu: Ividiyo ethi "%s" ayikho.

source: Thimble
zu: I-Thimble

source: This account is already banned!
zu: I-akhawunti isivinjiwe vele!

source: This account is already being ignored!
zu: I-akhawunti vele isizitshiwe!

source: This account is inactive.
zu: Le akhawunti ayisebenzi.

source: This article doesn't have approved content yet.
zu: Le athikhili iqukethe okungakagunyazwa okwamanje.

source: This article is no longer maintained, so its content might be out of date.
zu: Le athikhili ayisanakiwe, ngakho okutholakala kuyona kungenzeka ukuthi sekudlulelwe yisikhathi.

source: This badge is awarded to contributors with 10 approved English edits during 2015.
zu: Leli bheji lihlonyuliswa abanegalelo abahlele okuyi-10 kwesiNgisi okugunyaziwe ngonyaka wezi-2015.

source: This badge is awarded to contributors with 10 approved translations edits during 2008.
zu: Leli bheji lihlonyuliswe abanegalelo abanezihumusho aziyi-10 ezigunyaziwe nezihleliwe ngonyaka wezi-2008.

source: This badge is awarded to contributors with 10 approved translations edits during 2009.
zu: Leli bheji lihlonyuliswe abanegalelo abanezihumusho aziyi-10 ezigunyaziwe nezihleliwe ngonyaka wezi-2009.

source: This badge is awarded to contributors with 10 approved translations edits during 2015.
zu: Leli bheji lihlonyuliswa abanegalelo abanezihumusho eziyi-10 ezigunyaziwe nezihleliwe ngonyaka wezi-2015.

source: This badge is awarded to contributors with 30 support forum replies during 2015.
zu: Leli bheji lihlonyuliswa abanegalelo abanezimpendulo zokwesekwa esithangamini ezingama-30 ngonyaka wezi-2015.

source: This badge is awarded to contributors with 50 Army of Awesome tweets during 2015.
zu: Leli bheji lihlonyuliswa abanegalelo abanama-tweet angama-50 eThimba Labaphambili ngonyaka wezi-2015.

source: This document does not have a current revision.
zu: Le dokhumenti ayinaso isibukezo samanje.

source: This document does not have a current translation.
zu: Le dokhumenti ayinaso isihumusho njengamanje.

source: This document has already been translated to the following locales:
zu: Le dokhumenti seyihumushiwe kulezi zindawo ezilandelayo:

source: This document has been translated to the following locales:
zu: Le dokhumenti isihumushelwe kulezi zindawo ezilandelayo:

source: This document has no revisions.
zu: Le dokhumenti ayinasibukezo.

source: This document is missing translations for the following locales:
zu: Le dokhumenti inezihumusho ezishodayo kulezi zindawo ezilandelayo:

source: This doesn't solve my problem
zu: Lokhu akusombululi inkinga yami

source: This edit does not make this article up to date. The English differences should not change on the next edit.
zu: Lokhu kulungisa akuyenzi le athikhili ihambisane nesikhathi. Izinguquko zesiNgisi kufanele zingashintshi ekulungiseni okulandelayo.

source: This email is already in use!
zu: I-imeyli kukhona oyisebenzisayo!

source: This email is automatically sent by a robot. Our robot cant respond to your question, but our forum contributors can! If you want to respond to them, please <a href="%(url)s">click here</a>.
zu: Le imeyli ithunyelwe ngokuzenzekela yirobhothi. Irobhothi lethu alikwazi ukuphendula umbuzo wakho, kodwa abasizayo kusithangami bangawuphendula! Uma ufuna ukuyiphendula, uyacelwa <a href="%(url)s">chofoza lapha</a>.

source: This email looks great!
zu: Le imeyli ibukeka iyinhle!

source: This feature is temporarily disabled while we perform website maintenance. Please use your browser's Back button and try again a little later.
zu: Le fisha icinyiswe okwesikhashana ngenkathi sisalungisa iwebhusayithi. Uyacelwa usebenzise inkinobho yesiphequluli ethi Emuva bese ubuye uzame emva kwesikhashana.

source: This field was populated automatically.
zu: Inkundla izigcwalele ngokuzenzekalela.

source: This forum is a discussion about improving the localization of the "%(title)s" article. If you want to improve the article content, go to the <a href="%(url)s">English article discussion</a>.
zu: Lesi sithangami yingxoxo mayelana nokwenziwa ngcono ukubhalwa njengokwasendaweni "%(title)s" se-athikhili. Uma ufuna ukwenza ngcono okuqukethwe ku-athikhili, hamba uye <a href="%(url)s">Kungxoxo ye-athikhili yesiLungu</a>.

source: This forum is a discussion about improving the "%(title)s" article.
zu: Lesi sithangami yingxoxo mayelana nokwenza ngcono i"%(title)s" athikhili.

source: This forum is a discussion about improving the "%(title)s" article. If you'd like to participate, please <a href="%(register_url)s">register</a>.
zu: Lesi sithangami yingxoxo mayelana nokwenza ngcono i"%(title)s" zamathikhili. Uma ungathanda ukuzibandakanya, uyacelwa ukuba <a href="%(register_url)s">ubhalise</a>.
